# Курс основы программирования на Python
# Задание по программированию: 0 в 1 и наоборот
# 08.04.2019
#
# Вводится число 0 или 1, необходимо вывести 1 или 0 соответственно.
#
# Формат ввода
#
# Число 0 или 1.
#
# Формат вывода
#
# Число 0 или 1.

number = int(input())
print((number - 1) % 2)
