# Курс основы программирования на Python
# Задание по программированию: 100 раз подряд в квадрате
# 08.04.2019
#
# Заданное число N записали 100 раз подряд и затем возвели в
# квадрат. Что получилось?
#
# Формат ввода
#
# Вводится целое неотрицательное число N не превышающее 1000.
#
# Формат вывода
#
# Выведите ответ на задачу.

a = input()
print(int(a * 100)**2)
