# Курс основы программирования на Python
# Задание по программированию: 100A
# 06.04.2019
#
# Запишите букву 'A' (латинскую, заглавную) 100 раз подряд.
# Сдайте на проверку программу, которая выводит эту строчку
# (только буквы, без кавычек или пробелов).

print('A' * 100)
