# Курс основы программирования на Python
# Задание по программированию: Первая цифра двузначного числа
# 05.04.2019
#
# Дано положительное двузначное число. Найдите
# число десятков в нем.
#
# Формат ввода
#
# Вводится единственное число (гарантируется, что
# оно соответствует условию задачи).
#
# Формат вывода
#
# Выведите ответ на задачу.

number = input()
print(number[0])
