# Курс основы программирования на Python
# Задание по программированию: Последняя цифра
# 05.04.2019
#
# Дано натуральное число. Выведите его последнюю цифру.
#
# Формат ввода
#
# Вводится единственное целое неотрицательное число
# (гарантируется, что оно не превышает 10000).
#
# Формат вывода
#
# Выведите ответ на задачу.

number = input()
for i in number:
    num = i
print(num)
