# Курс основы программирования на Python
# Задание по программированию: Пингвины
# 05.04.2019
#
# Формат ввода
#
# Вводится целое неотрицательное число N (N≤100).
#
# Формат вывода
#
# Выведите 2ᴺ.

number = int(input())
print(2**number)
